<?php
# それぞれの都市のデータ。100%マッチする人が選ぶであろう選択肢と、名前、画像、説明。
$places = [[60,60,100,40,60,60,80,100,100,100,"ハワイ","hawaii.png","ハワイは太平洋に浮かぶ楽園のような島々から成るアメリカ合衆国の州。白砂のビーチ、青い海、美しい自然が広がり、サーフィンやスノーケリングなどのアクティビティが楽しめます。ハワイアンカルチャーは、フラダンスやウクレレの音楽、伝統的な祭りとともに息づいており、優しい人々と共に楽しい時間を過ごすことができます。ハワイ島には活火山キラウエアがあり、その迫力ある噴火現象も一見の価値あり。多様な観光スポット、美食、歴史的な遺産も楽しめ、訪れる人々を魅了する魔法のような場所です。",0],
[100,100,60,80,100,100,100,100,60,100,"東京","tokyo.png","東京は、日本の首都であり、世界有数のメトロポリスです。近代と伝統が見事に融合し、高層ビルと歴史的な寺社が共存します。新宿や渋谷の煌びやかなネオン街、浅草の仲見世通り、皇居の美しい庭園など、多様な顔を持つエリアが存在します。グルメも充実しており、寿司、ラーメン、和食から国際的な料理まで幅広い選択があります。公共交通網は効率的で、新幹線や地下鉄で市内を簡単に移動できます。さらに、カルチャーシーンも豊かで、美術館、劇場、音楽ライブなどが楽しめます。東京は、刺激的で多彩な魅力を持ち、訪れる人々に深い印象を与える都市です。",1],
[100,60,60,100,100,100,100,100,60,100,"京都","kyoto.png","京都は、日本の歴史と美の宝庫。伝統と現代が調和する美しい都市で、古都ならではの風情が感じられます。数百年にわたる歴史的な寺院や神社が点在し、金閣寺や銀閣寺などの美しい建造物が見どころです。また、清水寺や伏見稲荷大社などのパワースポットも訪れる価値があります。京都の街並みは独自の文化と伝統を反映し、着物姿の人々が歩く風景は絵に描いたような美しさです。抹茶や京料理などの伝統的な食文化も堪能でき、食の楽しみも広がります。京都は、過去と現在が交錯する魅力的な都市で、日本の精髄を感じられる場所です。",2],
[40,100,40,100,40,40,100,60,80,60,"ニューヨーク","new york.png","ニューヨークはアメリカの最大都市で、多様な文化とエネルギーに満ちた国際的なメトロポリス。マンハッタンの高層ビル、自由の女神像、ブロードウェイのショーなど、世界的なアイコンが点在。セントラルパークやブルックリン橋などの名所もあり、多彩な風景が楽しめます。美術館やミュージアム、カフェ、レストランも充実し、アートや食文化の楽しみが広がります。多様性が豊かで、さまざまな文化が共存する都市であり、世界中からの移民と訪問者が交流します。その刺激的な雰囲気と多彩な魅力が、ニューヨークの特色を形作っています。",3],
[40,100,60,100,40,40,40,80,40,80,"ロンドン","london.png","ロンドンは英国の首都で、歴史的なランドマークと現代的な魅力が融合する魔法の都市。ビッグベンやバッキンガム宮殿などの象徴的な建造物があり、美術館や博物館が文化の宝庫。ウェストエンドの舞台芸術、多様な食文化、世界クラスのショッピングが楽しめます。ロイヤルファミリーや古都ならではの雰囲気も味わえ、金融、テクノロジー、芸術の中心としても輝いています。地下鉄で移動しやすく、多彩なエリアを巡る楽しみも広がります。多文化の融合と刺激的なエネルギーが溢れ、世界各国から人々が集まり、夢と冒険の舞台になるでしょう。",4],
[40,80,60,100,40,40,100,60,80,80,"パリ","paris.png","パリはフランスの美の都。エッフェル塔やルーヴル美術館など、歴史的な名所が数多くあり、セーヌ川が都市を流れます。シャンゼリゼ通りのショッピングやモンマルトルの風景も楽しめ、フランス料理とワインが味わい深いです。文学や芸術の拠点としても名高く、カフェ文化も根付いています。ファッションの首都としても有名で、世界的なブランドが軒を連ねます。季節ごとの祭りやイベントも盛りだくさんで、ロマンティックな夜景や美しい公園が訪れる人々を魅了します。パリは、歴史と魅力が溢れ、永遠の都市として世界中から愛される存在。",5],
[60,80,80,80,60,100,80,80,80,80,"メルボルン","melbourne.png","メルボルンはオーストラリアの都市で、洗練された文化とクリエイティブな雰囲気が漂います。カフェ文化が根付き、洗練された料理と美味しいコーヒーが楽しめることが特徴です。また、スポーツ施設も充実しており、メルボルン・クリケット・グラウンドやメルボルン・パークなどがスポーツ愛好家に人気です。国際的な雰囲気と多様性が融合し、ストリートアートやフェスティバルが市内を彩ります。経済的にも重要で、大学や研究機関も充実しています。魅力的な都市景観とフレンドリーな人々が、訪れる皆さんに深い印象を与えることでしょう。",6],
[40,60,100,60,40,40,80,100,80,100,"スイス","switzerland.png","スイスは、ヨーロッパ中心に広がる美しい国。山々に抱かれた風光明媚な景色や、清らかな湖が心に響きます。高級時計やチョコレート、精緻な工芸品が世界的に評価され、品質に誇りを持つ国です。アルプス山脈でのスキーやハイキング、水辺でのリゾートも楽しめ、アウトドア愛好家には魅力的。また、中立国として政治的な安定が特徴で、ジュネーブやチューリッヒなどの都市が国際機関の本部を抱え、国際的な交流の舞台となっています。豊かな文化遺産や言語の多様性が魅力で、歴史的な町並みや美術館も訪れる価値があります。",7],
[80,80,60,80,80,80,80,60,80,40,"インド","india.png","インドは南アジアに位置する多様な文化と歴史が息づく国です。古代の寺院や宮殿、ユネスコ世界遺産の遺跡が国土に広がり、古代の智慧が感じられます。ゴールデン・トライアングルのデリーやアグラ、美しいビーチ地帯、ヒマラヤ山脈の風景など、魅力的な観光スポットがあります。伝統的なカレーやスパイス料理は、豊かな味わいで全世界を魅了。ヨガや瞑想の実践が古来より広まり、心身の健康に寄与しています。人々の温かさと歓迎の姿勢が印象的で、カラフルな祭りや文化が生活を彩ります。インドは、多様な魅力と刺激的な体験が満載の国であり、訪れる人々に深い感銘を与えることでしょう。",8],
[40,80,60,100,40,40,100,60,80,80,"ローマ","rome.png","ローマは、イタリアの首都であり、古代の栄光と文化の息吹が調和する魅力的な都市です。コロッセオやローマン・フォーラムなどの古代の遺跡が歴史の舞台を偲ばせ、バチカン市国のサンピエトロ大聖堂やシスティーナ礼拝堂は芸術と宗教の傑作を鑑賞できます。美術館やギャラリーには、数々の名画が収められ、芸術愛好家に喜びをもたらします。狭い路地や広場が風情を醸し、イタリアンカルチャーが息づく雰囲気が心に残ります。また、美味しい料理やワインの楽しみも広がり、イタリアの食文化を満喫できます。ローマは、歴史と現代が調和する魅力的な都市であり、その魔法に魅了されることでしょう。",9],
[80,80,60,100,80,80,80,80,80,60,"北京","beijing.png","北京は、中国の首都で、古代と現代が共存する魅力的な都市です。万里の長城や紫禁城など、歴史的な名所が点在し、古代の栄光を偲ぶことができます。天安門広場は国の象徴であり、広大な広場で歴史的瞬間が刻まれました。現代の高層ビルや近代的なショッピング街も広がり、都市のダイナミズムも感じられます。また、北京料理や北京オペラなど、伝統的な文化も楽しむことができます。中国の政治、経済、文化の中心地であり、国際的な交流の拠点でもあります。北京の人々の温かさと歓迎の姿勢も魅力で、中国の多彩な魅力を体感できる場所です。",10],
[40,100,60,80,40,40,80,60,100,60,"ロサンジェルス","losangels.png","ロサンゼルスは、太平洋に面した魅力的なアメリカの都市です。ハリウッドの輝きが映画とエンターテインメントの拠点として知られ、ウォーク・オブ・フェームには多彩なスターの名前が刻まれています。美術館やギャラリーが芸術の宝庫であり、様々なアートが展示されています。ビーチや自然が心地よく、アウトドア愛好家にも楽しみが広がります。多様な食文化が交錯し、グルメも楽しめます。国際都市として、異なる文化が共存し、国際色豊かな雰囲気が広がっています。クリエイティビティと新しいアイデアが溢れ、未来への可能性が感じられる魅力的な都市です。",11],
[60,60,80,80,60,60,80,60,80,60,"イスタンブール","istanbul.png","イスタンブールは、トルコの宝石ともいえる魅力的な都市です。東西文化の交差点に位置し、歴史的な遺産とモダンなエネルギーが共鳴しています。ボスポラス海峡が市を二分し、古都の要塞や宮殿がその岸に佇む光景は壮観。ブルーモスクやアヤソフィアなどの美しい建造物は、芸術と宗教の融合を感じさせます。市場やバザールでは伝統的な商品が溢れ、豊かな文化が息づいています。トルコ料理やスイーツは、舌を喜ばせる味わいがあります。イスタンブールは、独自の魅力があり、その魔法に魅了されることでしょう。",12],
[40,60,100,60,40,40,80,60,80,60,"南アフリカ","southafrica.png","南アフリカは、アフリカ大陸の美しい宝石として輝く国です。壮大な自然景観が広がり、サファリで野生動物との贅沢な出会いが楽しめます。タフな歴史と向き合いながら、多様な文化と人種が共存し、国民和合の風土が育まれています。都市部のケープタウンやヨハネスブルグは、現代的なエネルギーが溢れ、アートや音楽も盛ん。ガーデン・ルートなどの景勝地やワイナリーも魅力的で、アウトドア愛好家や美食家にとって楽園。自然保護や環境保全への取り組みも強く、生態系の豊かさが感じられます。南アフリカは、多彩な魅力が広がり、その温かな雰囲気と自然の美しさが心を打つことでしょう。",13],
[100,60,100,80,80,80,80,60,80,60,"タイ","thailand.png","タイは、東南アジアの素晴らしい国です。美しい寺院や歴史的遺跡があり、仏教文化が息づいています。バンコクの都会の輝きや、チェンマイの風光明媚な自然が楽しめます。タイ料理はスパイスの絶妙な調和が魅力で、グルメにとって楽園。美しいビーチやアイランドもあり、リゾート地としても魅力的。エレファント体験やヨガも人気のアクティビティ。文化的な祭りやイベントが一年を彩り、多彩な表情を見せます。タイの人々は心温まる笑顔で迎え、おもてなしの心が感じられます。タイは、自然と文化、人々の温かさが調和する、心に残る国です。",14]
];

#それぞれの都市のマッチ度が入っていく変数。
$match = [];

#都市のデータと解答のデータがどれぐらい離れているかを求めて、マッチ度をmatch変数に入れていく。
$cnt = 0 ;
foreach ($places as $place){
    $sum_match = 0;
    for ($i = 0;$i<=9;$i++){
        $sum_match = $sum_match + (100-(abs(intval($_GET[strval($i)])-$place[$i])));
    }
    $match [$cnt]=$sum_match/10;
    $cnt++;   
} 

#1番マッチ度が高い場所をとる　＄matchの配列のどこにあるかわかれば、$placesからそれに一致するデータを取れる！
#>を使っているから、同じ値の場合、最初の方にあるデータが選ばれる。
#position 1は、一番高いデータが配列（$placesと＄match）のどこにあるかを示す。
#$count変数を使って、毎回何番目の配列のことを考えているかを示す。それで、もし一番高いやつとかが見つかったら、その時の配列の番号を$position変数に記憶しておく
#$countは今どの番号を考えているかを示してくれて、＄positionは最終的な高いやつの配列番号を示してくれる。

$high1 = 0;
$cnt = 0;

foreach($match as $mtc){
    if ($high1<$mtc){
        $high1=$mtc;
        $position1 = $cnt;
    }
    $cnt=$cnt+1;
}

#2番目にマッチ度が高い場所をとる。１番高いデータを一時的に除くために、100で割っておく。
$high2 = 0;
$cnt = 0;
$match [$position1] = $high1/100;

foreach($match as $mtc){
    if ($high2<$mtc){
        $high2=$mtc;
        $position2 = $cnt;
    }
    $cnt=$cnt+1;
}

#3番目にマッチ度が高い場所をとる。２番目に高いデータを一時的に除くために、100で割っておく。
$high3 = 0;
$cnt = 0;
$match[$position2] = $high2/100;

foreach($match as $mtc){
    if ($high3<$mtc){
        $high3=$mtc;
        $position3 = $cnt;
    }
    $cnt=$cnt+1;
}

#一時的に値を低くしたマッチ度をもとに戻す。$high1とか$high2は最終的には使わない値。比較するときだけ必要やった値。
#結局その値は$match配列でpositionを指定すれば取れるから。
#マッチ度の値を一時的に下げたりしたから、バックアップとして＄highの変数にデータを入れておく必要があった。だからポジションを取るだけではダメで保存に必要あり。
#マッチ配列も場所の配列も、同じ順番で並んでいるから、一番高いやつとかのマッチ度とかデータがポジション変数（#position）だけで使えるようになる

$match [$position1] = $high1;
$match [$position2] = $high2;

#1位2位3位の場所たちを含む配列。
$topplaces = [$places[$position1],$places[$position2],$places[$position3]]

?>

<!DOCTYPE html>
<html lang="en">
<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <link rel="stylesheet" href="recommendation.css">
    <title>WhereToGo</title>
</head>
<body>
    <div class = "header">
<img src="logo5.png">
    </div>

    <div class = "main">
    <h1>診断結果</h1>
    <?php $i=1?>
<?php foreach ($topplaces as $place): ?>
    <div class = "place">
    <h2><?php echo ($i)?>位&nbsp;<?php echo ($place[10]) ?>&nbsp;<?php echo ($match[$place[13]]) ?>%</h2>
    <img src="<?php echo ($place[11]) ?>">
    <p><?php echo ($place[12])?></p>
    <?php $i=$i+1?>
</div>
<?php endforeach ?> 

</div>  

    <div class = "footer">
<p>Copyright © 2023 WhereToGo All Rights Reserved.</p>
    </div>  
</body>
</html>